//
// Created by feng on 2020/11/2.
//

#ifndef RK3399_SPI_CONFIG_H
#define RK3399_SPI_CONFIG_H

//类属性初始化
#define MONITOR_PAGE_INDEX      0
#define MONITOR_PAGE_NUM        4
#define MONITOR_PAGE_SIZE_NUM   32
/*
 * [PAGE,0,id,0]
 * PAGE:0-1 运动臂A、B臂数据格式如下，依次顺序读取：
0 旋转臂旋转编码12位                            1 基座水平移动编码12位               2 反射传感器数值8（高度）+8（距离） 位
3 透射传感器数值4（高度）+4（距离）位              4 卡线传感器数值4位                  5 抬线电机传感器数值4位
6 扭力传感器数值12位                            7 姿态传感器X数值 12位               8 姿态传感器Y数值 12位
9 循迹电机传感器8位                             10 循迹轮传感器8+8位11 导航数据24+24+24位
12 行进电机行进距离数据：每100MS的行走距离数据 数据包号序号：8位,行走距离：8位 （cm 为单位，最高位为方向）
13 各个电机部件（运动臂）的工作状态16位 （比如： 11正向工作，01反向工作，10自锁状态，00停止）
 （行走电机： 遇到障碍时自动停止，并给出相应状态）
14 当前执行的命令包序号8位
*PAGE:2 作业臂数据格式如下：
1.水平位移传感器编码12位                       2. 4连杆位置编码   12位               3. 4连杆电机扭力   8位
4. 仰角编码     12位                         5. （霍尔）批头弹力传感器  8位          6. 批头电机扭力传感器      8位
7. 批头位置（光栅）    8位                    8. 4个电机工作状态    16位             9. 当前执行的命令包序号 8位

 *PAGE:3 主机箱数据格式如下：
1. 水平位移传感器编码 12位                    2. 主机箱姿态Z角度读数  12位            3. 机架中心点距离导线起点的距离24位
4. 前方第一障碍物“前端点”距离机架中心点导航距离  12位  （厘米为单位）           5. 前方第一障碍物长度距离  8位  （厘米为单位）
6. 前方第一障碍物“前端长度”  8位  （厘米为单位）              7. 前方第一障碍物“后端长度”  8位  （厘米为单位）
 中间没有抓取点时，上面的3个长度相等     8. 当前导线方向  12位          9. 目标导线方向  12位
10. 主电源电量值8位            11. 电机工作状态 8位                  12. 当前执行的命令包序号 8位
*/
#define MonitorUnitMap {\
    {2,2,2,2,2,1,1,1,2,2,2,1,2,2,2,2,2,1},\
    {2,2,2,2,2,1,1,1,2,2,2,1,2,2,2,2,2,1},\
    {2,2,1,2,1,1,1,2,1},\
    {2,6,3,2,1,1,1,2,2,2,1,1},\
    }
#define CommandMap {\
    {0,1,4,5,6,7,8,9,10,11,12,13,15,16,17,2,3,14},\
    {0,1,4,5,6,7,8,9,10,11,12,13,15,16,17,2,3,14},\
    {0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16},\
    {0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16},\
    } 
#define CONTROL_PAGE_NUM    4
#define CONTROL_PAGE_SIZE_NUM   32
#define SPI_BITS    8
#define SPI_MODE    0
#define SPI_SPEED   500000
#define SPI_DEVICE  "/dev/spidev32765.0"

#define SOCKET_PORT 80

#endif //RK3399_SPI_CONFIG_H
